Tekla Open API Reference for Tekla Structures 2025
LibraryProfileItem Methods
The LibraryProfileItem type exposes the following members.
Methods
Name | Description
AddCrossSection
 Adds the cross section to a profile.
 (Inherited from ProfileItem.)
Copy
 Copy the library profile item in the profile database to item with new name.
Delete
 Deletes the profile item in the profile database.
DeleteCrossSection
 Deletes the cross section of a profile.
 (Inherited from ProfileItem.)
Export
 Exports the profile item in the profile database to given file name. Currently library profiles, sketch profiles and clb profiles are supported. Library profiles are exported to *.lis format. Sketch profiles are exported to *.uel format. Clb profiles are exported to *.clb format. If path is not given profile is exported to model folder. If filename is empty profile name or prefix is used as filename.
 (Inherited from ProfileItem.)
GetCrossSection
 Returns list of cross section points of inner surfaces from the profile item.
 (Inherited from ProfileItem.)
GetHighAccuracyCrossSection
 Get cross section with high accuracy.
 (Inherited from ProfileItem.)
GetProfileItemSubTypes()
 Selects the profile item and updates the sub types in the profile database.
 (Inherited from ProfileItem.)
IsProfileUserDefined
 Whether the profile is a fixed user-defined profile.
 (Inherited from ProfileItem.)
IsProfileUserParametric
 Whether the profile is a parametric user-defined profile. If so, the prefix can be asked by type and subtype.
 (Inherited from ProfileItem.)
Modify
 Modifies the profile item in the profile database.
ModifyCrossSection
 Modifies the cross section of a profile.
 (Inherited from ProfileItem.)
ModifyProfileItemAnalysisParameter
 Modify analysis parameter of library profile item. Modify is needed for profile item for updating changes to profile database
 (Inherited from ProfileItem.)
ModifyProfileItemParameter
 Modify parameter of library profile item. Modify is needed for profile item for updating changes to profile database
 (Inherited from ProfileItem.)
ModifyProfileItemUserParameter
 Modify user parameter of library profile item. Modify is needed for profile item for updating changes to profile database
 (Inherited from ProfileItem.)
Select()
 Selects the profile item in the profile database.
 (Inherited from ProfileItem.)
Select(String)
 Selects the profile item in the profile database using the given name.
SelectCrossSections
 Selects the profile item cross section in the profile database.
 (Inherited from ProfileItem.)
SetEquivalentType
 Sets the equivalent type for the specified cross section.
 (Inherited from ProfileItem.)
Top
See Also
Reference
LibraryProfileItem Class
Tekla.Structures.Catalogs Namespace